#НАСТРОЙКИ

settings = {
    'use_proxy': True,
    # ИСПОЛЬЗОВАТЬ ЛИ ПРОКСИ
    'max_batch_wallets': 20,
    # МАКСИМУМ КОШЕЛЬКОВ ОДНОВРЕМЕННО В РАБОТЕ (НЕ БОЛЬШЕ 50)
    'mode': 0,
    # РЕЖИМ РАБОТЫ | 0 - GM СТРИК | 1 - VERIFY ВСЕХ КВЕСТОВ ЗА НЕДЕЛЮ | 2 - КЛЕЙМ XP ДЛЯ ВСЕХ КВЕСТОВ НА НЕДЕЛЮ | 3 - ПРИВЯЗКА TWITTER И ВЫПОЛНЕНИЕ 0-ОЙ НЕДЕЛИ | 4 - TOMO ПРИВЯЗКА
    'quest_id': '6572fc0bef415b56fd67608f',
    # ID НЕДЕЛИ КВЕСТОВ - ПРИМЕР ССЫЛКИ НА НЕДЕЛЮ МЕТАМАСКА - https://www.intract.io/linea/quest/654a0e8d95c012164b1f1620 | 655b48ec2e9188e21c94e93e
    'min_delay': 0,
    # МИН ЗАДЕРЖКА МЕЖДУ ДЕЙСТВИЯМИ (ЗАПРОСАМИ)
    'max_delay': 0.2
    # МАКС ЗАДЕРЖКА МЕЖДУ ДЕЙСТВИЯМИ (ЗАПРОСАМИ)
}